[Killed] StringLiteral
ui/core/button/theme.ts:16:18
         border border-transparent
         active:bg-blue-800 active:shadow-[inset_0_4px_8px_rgba(0,0,0,0.4)]
       `,
-      secondary: `
-        bg-gray-100 text-gray-900 hover:bg-gray-200 focus:ring-gray-500
-        border border-gray-300 hover:border-gray-400
-        active:bg-gray-300 active:shadow-[inset_0_4px_8px_rgba(0,0,0,0.2)]
-      `,
+      secondary: ``,
       tertiary: `
         bg-transparent text-blue-600 hover:bg-blue-50 focus:ring-blue-500
killedBy: Button Component Variants renders secondary variant correctly
statusReason: expected [ Array(19) ] to include 'bg-gray-100'

[Killed] StringLiteral
ui/core/button/theme.ts:21:17
         border border-gray-300 hover:border-gray-400
         active:bg-gray-300 active:shadow-[inset_0_4px_8px_rgba(0,0,0,0.2)]
       `,
-      tertiary: `
-        bg-transparent text-blue-600 hover:bg-blue-50 focus:ring-blue-500
-        border border-transparent hover:border-blue-200
-        active:bg-blue-100 active:shadow-[inset_0_4px_8px_rgba(59,130,246,0.2)]
-      `,
+      tertiary: ``,
       danger: `
         bg-red-600 text-white hover:bg-red-700 focus:ring-red-500
killedBy: Button Component Variants renders tertiary variant correctly
statusReason: expected [ Array(19) ] to include 'bg-transparent'

[Killed] StringLiteral
ui/core/button/theme.ts:31:16
         border border-transparent
         active:bg-red-800 active:shadow-[inset_0_4px_8px_rgba(0,0,0,0.4)]
       `,
-      success: `
-        bg-green-600 text-white hover:bg-green-700 focus:ring-green-500
-        border border-transparent
-        active:bg-green-800 active:shadow-[inset_0_4px_8px_rgba(0,0,0,0.4)]
-      `,
+      success: ``,
       warning: `
         bg-yellow-500 text-white hover:bg-yellow-600 focus:ring-yellow-500
killedBy: Button Component Variants renders success variant correctly
statusReason: expected [ Array(19) ] to include 'bg-green-600'

[Killed] StringLiteral
ui/core/button/theme.ts:46:11
       xs: 'px-2 py-1 text-xs',
       sm: 'px-3 py-1.5 text-sm',
       md: 'px-4 py-2 text-sm',
-      lg: 'px-6 py-3 text-base',
+      lg: "",
       xl: 'px-8 py-4 text-lg'
     },
killedBy: Button Component Sizes renders lg size correctly
statusReason: expected [ Array(24) ] to include 'px-6'

[Killed] ObjectLiteral
ui/core/button/theme.ts:49:20
       lg: 'px-6 py-3 text-base',
       xl: 'px-8 py-4 text-lg'
     },
-    iconOnlySizes: {
-      xs: 'p-1',
-      sm: 'p-1.5',
-      md: 'p-2',
-      lg: 'p-3',
-      xl: 'p-4'
-    },
+    iconOnlySizes: {},
     rounded: {
       none: 'rounded-none',
killedBy: Button Component Icon Only Sizes renders xs icon-only size correctly
statusReason: expected [ Array(24) ] to include 'p-1'

[Killed] StringLiteral
ui/core/button/theme.ts:51:11
     },
     iconOnlySizes: {
       xs: 'p-1',
-      sm: 'p-1.5',
+      sm: "",
       md: 'p-2',
       lg: 'p-3',
killedBy: Button Component Icon Only Sizes renders sm icon-only size correctly
statusReason: expected [ Array(24) ] to include 'p-1.5'

[Killed] StringLiteral
ui/core/button/theme.ts:53:11
       xs: 'p-1',
       sm: 'p-1.5',
       md: 'p-2',
-      lg: 'p-3',
+      lg: "",
       xl: 'p-4'
     },
killedBy: Button Component Icon Only Sizes renders lg icon-only size correctly
statusReason: expected [ Array(24) ] to include 'p-3'

[Killed] StringLiteral
ui/core/button/theme.ts:54:11
       sm: 'p-1.5',
       md: 'p-2',
       lg: 'p-3',
-      xl: 'p-4'
+      xl: ""
     },
     rounded: {
killedBy: Button Component Icon Only Sizes renders xl icon-only size correctly
statusReason: expected [ Array(24) ] to include 'p-4'

[Killed] StringLiteral
ui/core/button/theme.ts:61:13
       sm: 'rounded-sm',
       md: 'rounded-md',
       lg: 'rounded-lg',
-      full: 'rounded-full'
+      full: ""
     }
   },
killedBy: Button Component Rounded Variants renders full rounded variant correctly
statusReason: expected [ Array(26) ] to include 'rounded-full'

[Survived] StringLiteral
ui/core/button/theme.ts:65:11
     }
   },
   icon: {
-    base: '',
+    base: "Stryker was here!",
     sizes: {
       xs: 'w-3 h-3',

[Killed] StringLiteral
ui/core/button/theme.ts:67:11
   icon: {
     base: '',
     sizes: {
-      xs: 'w-3 h-3',
+      xs: "",
       sm: 'w-4 h-4',
       md: 'w-4 h-4',
killedBy: Button Component Icon Sizes renders correct icon size for xs
statusReason: expected [ 'mr-2' ] to include 'w-3'

[Killed] StringLiteral
ui/core/button/theme.ts:69:11
     sizes: {
       xs: 'w-3 h-3',
       sm: 'w-4 h-4',
-      md: 'w-4 h-4',
+      md: "",
       lg: 'w-5 h-5',
       xl: 'w-6 h-6'
killedBy: Button Component Icon Sizes renders correct icon size for md
statusReason: expected [ 'mr-2' ] to include 'w-4'

[Killed] StringLiteral
ui/core/button/theme.ts:70:11
       xs: 'w-3 h-3',
       sm: 'w-4 h-4',
       md: 'w-4 h-4',
-      lg: 'w-5 h-5',
+      lg: "",
       xl: 'w-6 h-6'
     }
killedBy: Button Component Icon Sizes renders correct icon size for lg
statusReason: expected [ 'mr-2' ] to include 'w-5'

[Killed] StringLiteral
ui/core/button/theme.ts:71:11
       sm: 'w-4 h-4',
       md: 'w-4 h-4',
       lg: 'w-5 h-5',
-      xl: 'w-6 h-6'
+      xl: ""
     }
   },
killedBy: Button Component Icon Sizes renders correct icon size for xl
statusReason: expected [ 'mr-2' ] to include 'w-6'

[Survived] ObjectLiteral
ui/core/button/theme.ts:74:12
       xl: 'w-6 h-6'
     }
   },
-  content: {
-    base: ''
-  },
+  content: {},
   loading: {
     base: 'animate-spin',

[Killed] ObjectLiteral
ui/core/button/theme.ts:77:12
   content: {
     base: ''
   },
-  loading: {
-    base: 'animate-spin',
-    sizes: {
-      xs: 'w-3 h-3',
-      sm: 'w-4 h-4',
-      md: 'w-4 h-4',
-      lg: 'w-5 h-5',
-      xl: 'w-6 h-6'
-    }
-  }
+  loading: {}
 }
 
killedBy: Button Component States renders loading state correctly
statusReason: Cannot read properties of undefined (reading 'md')

[Survived] ObjectLiteral
ui/core/button/theme.ts:90:28
 }
 
 // Legacy export for backward compatibility
-export const buttonTheme = {
-  base: defaultButtonTheme.root.base,
-  variants: defaultButtonTheme.root.variants,
-  sizes: defaultButtonTheme.root.sizes,
-  iconOnlySizes: defaultButtonTheme.root.iconOnlySizes,
-  iconSizes: defaultButtonTheme.icon.sizes,
-  rounded: defaultButtonTheme.root.rounded,
-  loading: {
-    spinner: defaultButtonTheme.loading.base,
-    sizes: defaultButtonTheme.loading.sizes
-  }
-}
+export const buttonTheme = {}
 
 // Theme types

[Killed] BlockStatement
ui/core/button/theme.ts:130:61
 export type ButtonRounded = keyof typeof buttonTheme.rounded
 
 // Utility function to merge custom theme with default theme
-export function mergeButtonTheme(customTheme?: ButtonTheme) {
-  if (!customTheme) return defaultButtonTheme
-
-  return {
-    root: {
-      base: customTheme.root?.base ?? defaultButtonTheme.root.base,
-      variants: { ...defaultButtonTheme.root.variants, ...customTheme.root?.variants },
-      sizes: { ...defaultButtonTheme.root.sizes, ...customTheme.root?.sizes },
-      iconOnlySizes: { ...defaultButtonTheme.root.iconOnlySizes, ...customTheme.root?.iconOnlySizes },
-      rounded: { ...defaultButtonTheme.root.rounded, ...customTheme.root?.rounded }
-    },
-    icon: {
-      base: customTheme.icon?.base ?? defaultButtonTheme.icon.base,
-      sizes: { ...defaultButtonTheme.icon.sizes, ...customTheme.icon?.sizes }
-    },
-    content: {
-      base: customTheme.content?.base ?? defaultButtonTheme.content.base
-    },
-    loading: {
-      base: customTheme.loading?.base ?? defaultButtonTheme.loading.base,
-      sizes: { ...defaultButtonTheme.loading.sizes, ...customTheme.loading?.sizes }
-    }
-  }
-}
+export function mergeButtonTheme(customTheme?: ButtonTheme) {}
killedBy: Button Component Basic Rendering renders with default props
statusReason: Cannot read properties of undefined (reading 'root')

[Killed] ConditionalExpression
ui/core/button/theme.ts:131:7
 
 // Utility function to merge custom theme with default theme
 export function mergeButtonTheme(customTheme?: ButtonTheme) {
-  if (!customTheme) return defaultButtonTheme
+  if (true) return defaultButtonTheme
 
   return {
killedBy: Button Component Theme Customization applies custom theme
statusReason: expected [ Array(27) ] to include 'custom-base-class'

[Killed] ConditionalExpression
ui/core/button/theme.ts:131:7
 
 // Utility function to merge custom theme with default theme
 export function mergeButtonTheme(customTheme?: ButtonTheme) {
-  if (!customTheme) return defaultButtonTheme
+  if (false) return defaultButtonTheme
 
   return {
killedBy: Button Component Basic Rendering renders with default props
statusReason: Cannot read properties of undefined (reading 'root')

[Killed] LogicalOperator
ui/core/button/theme.ts:135:13
 
   return {
     root: {
-      base: customTheme.root?.base ?? defaultButtonTheme.root.base,
+      base: customTheme.root?.base && defaultButtonTheme.root.base,
       variants: { ...defaultButtonTheme.root.variants, ...customTheme.root?.variants },
       sizes: { ...defaultButtonTheme.root.sizes, ...customTheme.root?.sizes },
killedBy: Button Component Theme Customization applies custom theme
statusReason: expected [ Array(20) ] to include 'custom-base-class'

[Survived] OptionalChaining
ui/core/button/theme.ts:135:13
 
   return {
     root: {
-      base: customTheme.root?.base ?? defaultButtonTheme.root.base,
+      base: customTheme.root.base ?? defaultButtonTheme.root.base,
       variants: { ...defaultButtonTheme.root.variants, ...customTheme.root?.variants },
       sizes: { ...defaultButtonTheme.root.sizes, ...customTheme.root?.sizes },

[Survived] OptionalChaining
ui/core/button/theme.ts:136:59
   return {
     root: {
       base: customTheme.root?.base ?? defaultButtonTheme.root.base,
-      variants: { ...defaultButtonTheme.root.variants, ...customTheme.root?.variants },
+      variants: { ...defaultButtonTheme.root.variants, ...customTheme.root.variants },
       sizes: { ...defaultButtonTheme.root.sizes, ...customTheme.root?.sizes },
       iconOnlySizes: { ...defaultButtonTheme.root.iconOnlySizes, ...customTheme.root?.iconOnlySizes },

[Survived] OptionalChaining
ui/core/button/theme.ts:137:53
     root: {
       base: customTheme.root?.base ?? defaultButtonTheme.root.base,
       variants: { ...defaultButtonTheme.root.variants, ...customTheme.root?.variants },
-      sizes: { ...defaultButtonTheme.root.sizes, ...customTheme.root?.sizes },
+      sizes: { ...defaultButtonTheme.root.sizes, ...customTheme.root.sizes },
       iconOnlySizes: { ...defaultButtonTheme.root.iconOnlySizes, ...customTheme.root?.iconOnlySizes },
       rounded: { ...defaultButtonTheme.root.rounded, ...customTheme.root?.rounded }

[Survived] OptionalChaining
ui/core/button/theme.ts:138:69
       base: customTheme.root?.base ?? defaultButtonTheme.root.base,
       variants: { ...defaultButtonTheme.root.variants, ...customTheme.root?.variants },
       sizes: { ...defaultButtonTheme.root.sizes, ...customTheme.root?.sizes },
-      iconOnlySizes: { ...defaultButtonTheme.root.iconOnlySizes, ...customTheme.root?.iconOnlySizes },
+      iconOnlySizes: { ...defaultButtonTheme.root.iconOnlySizes, ...customTheme.root.iconOnlySizes },
       rounded: { ...defaultButtonTheme.root.rounded, ...customTheme.root?.rounded }
     },

[Survived] ObjectLiteral
ui/core/button/theme.ts:138:22
       base: customTheme.root?.base ?? defaultButtonTheme.root.base,
       variants: { ...defaultButtonTheme.root.variants, ...customTheme.root?.variants },
       sizes: { ...defaultButtonTheme.root.sizes, ...customTheme.root?.sizes },
-      iconOnlySizes: { ...defaultButtonTheme.root.iconOnlySizes, ...customTheme.root?.iconOnlySizes },
+      iconOnlySizes: {},
       rounded: { ...defaultButtonTheme.root.rounded, ...customTheme.root?.rounded }
     },

[Survived] OptionalChaining
ui/core/button/theme.ts:139:57
       variants: { ...defaultButtonTheme.root.variants, ...customTheme.root?.variants },
       sizes: { ...defaultButtonTheme.root.sizes, ...customTheme.root?.sizes },
       iconOnlySizes: { ...defaultButtonTheme.root.iconOnlySizes, ...customTheme.root?.iconOnlySizes },
-      rounded: { ...defaultButtonTheme.root.rounded, ...customTheme.root?.rounded }
+      rounded: { ...defaultButtonTheme.root.rounded, ...customTheme.root.rounded }
     },
     icon: {

[Survived] ObjectLiteral
ui/core/button/theme.ts:139:16
       variants: { ...defaultButtonTheme.root.variants, ...customTheme.root?.variants },
       sizes: { ...defaultButtonTheme.root.sizes, ...customTheme.root?.sizes },
       iconOnlySizes: { ...defaultButtonTheme.root.iconOnlySizes, ...customTheme.root?.iconOnlySizes },
-      rounded: { ...defaultButtonTheme.root.rounded, ...customTheme.root?.rounded }
+      rounded: {}
     },
     icon: {

[Killed] OptionalChaining
ui/core/button/theme.ts:142:13
       rounded: { ...defaultButtonTheme.root.rounded, ...customTheme.root?.rounded }
     },
     icon: {
-      base: customTheme.icon?.base ?? defaultButtonTheme.icon.base,
+      base: customTheme.icon.base ?? defaultButtonTheme.icon.base,
       sizes: { ...defaultButtonTheme.icon.sizes, ...customTheme.icon?.sizes }
     },
killedBy: Button Component Theme Customization applies custom theme
statusReason: Cannot read properties of undefined (reading 'base')

[Survived] LogicalOperator
ui/core/button/theme.ts:142:13
       rounded: { ...defaultButtonTheme.root.rounded, ...customTheme.root?.rounded }
     },
     icon: {
-      base: customTheme.icon?.base ?? defaultButtonTheme.icon.base,
+      base: customTheme.icon?.base && defaultButtonTheme.icon.base,
       sizes: { ...defaultButtonTheme.icon.sizes, ...customTheme.icon?.sizes }
     },

[Killed] OptionalChaining
ui/core/button/theme.ts:143:53
     },
     icon: {
       base: customTheme.icon?.base ?? defaultButtonTheme.icon.base,
-      sizes: { ...defaultButtonTheme.icon.sizes, ...customTheme.icon?.sizes }
+      sizes: { ...defaultButtonTheme.icon.sizes, ...customTheme.icon.sizes }
     },
     content: {
killedBy: Button Component Theme Customization applies custom theme
statusReason: Cannot read properties of undefined (reading 'sizes')

[Killed] OptionalChaining
ui/core/button/theme.ts:146:13
       sizes: { ...defaultButtonTheme.icon.sizes, ...customTheme.icon?.sizes }
     },
     content: {
-      base: customTheme.content?.base ?? defaultButtonTheme.content.base
+      base: customTheme.content.base ?? defaultButtonTheme.content.base
     },
     loading: {
killedBy: Button Component Theme Customization applies custom theme
statusReason: Cannot read properties of undefined (reading 'base')

[Survived] LogicalOperator
ui/core/button/theme.ts:146:13
       sizes: { ...defaultButtonTheme.icon.sizes, ...customTheme.icon?.sizes }
     },
     content: {
-      base: customTheme.content?.base ?? defaultButtonTheme.content.base
+      base: customTheme.content?.base && defaultButtonTheme.content.base
     },
     loading: {

[Survived] ObjectLiteral
ui/core/button/theme.ts:148:14
     content: {
       base: customTheme.content?.base ?? defaultButtonTheme.content.base
     },
-    loading: {
-      base: customTheme.loading?.base ?? defaultButtonTheme.loading.base,
-      sizes: { ...defaultButtonTheme.loading.sizes, ...customTheme.loading?.sizes }
-    }
+    loading: {}
   }
 }

[Killed] OptionalChaining
ui/core/button/theme.ts:149:13
       base: customTheme.content?.base ?? defaultButtonTheme.content.base
     },
     loading: {
-      base: customTheme.loading?.base ?? defaultButtonTheme.loading.base,
+      base: customTheme.loading.base ?? defaultButtonTheme.loading.base,
       sizes: { ...defaultButtonTheme.loading.sizes, ...customTheme.loading?.sizes }
     }
killedBy: Button Component Theme Customization applies custom theme
statusReason: Cannot read properties of undefined (reading 'base')

[Survived] LogicalOperator
ui/core/button/theme.ts:149:13
       base: customTheme.content?.base ?? defaultButtonTheme.content.base
     },
     loading: {
-      base: customTheme.loading?.base ?? defaultButtonTheme.loading.base,
+      base: customTheme.loading?.base && defaultButtonTheme.loading.base,
       sizes: { ...defaultButtonTheme.loading.sizes, ...customTheme.loading?.sizes }
     }

[Killed] OptionalChaining
ui/core/button/theme.ts:150:56
     },
     loading: {
       base: customTheme.loading?.base ?? defaultButtonTheme.loading.base,
-      sizes: { ...defaultButtonTheme.loading.sizes, ...customTheme.loading?.sizes }
+      sizes: { ...defaultButtonTheme.loading.sizes, ...customTheme.loading.sizes }
     }
   }
killedBy: Button Component Theme Customization applies custom theme
statusReason: Cannot read properties of undefined (reading 'sizes')
