[Killed] StringLiteral
ui/core/tag/theme.ts:9:16
     variants: {
       default: 'bg-gray-100 text-gray-700 hover:bg-gray-200 focus:ring-gray-400 active:bg-gray-200 active:shadow-inner active:shadow-gray-400/60 border border-transparent',
-      success: 'bg-green-100 text-green-700 hover:bg-green-200 focus:ring-green-400 active:bg-green-200 active:shadow-inner active:shadow-green-400/60 border border-transparent',
+      success: "",
       info: 'bg-blue-100 text-blue-700 hover:bg-blue-200 focus:ring-blue-400 active:bg-blue-200 active:shadow-inner active:shadow-blue-400/60 border border-transparent',
       warning: 'bg-yellow-100 text-yellow-700 hover:bg-yellow-200 focus:ring-yellow-400 active:bg-yellow-200 active:shadow-inner active:shadow-yellow-400/60 border border-transparent',
killedBy: Tag Component Static vs Interactive Variants applies interactive variant classes when clickable
statusReason: expected 'inline-flex items-center justify-cent…' to contain 'hover:'

[Survived] StringLiteral
ui/core/tag/theme.ts:10:13
     variants: {
       default: 'bg-gray-100 text-gray-700 hover:bg-gray-200 focus:ring-gray-400 active:bg-gray-200 active:shadow-inner active:shadow-gray-400/60 border border-transparent',
       success: 'bg-green-100 text-green-700 hover:bg-green-200 focus:ring-green-400 active:bg-green-200 active:shadow-inner active:shadow-green-400/60 border border-transparent',
-      info: 'bg-blue-100 text-blue-700 hover:bg-blue-200 focus:ring-blue-400 active:bg-blue-200 active:shadow-inner active:shadow-blue-400/60 border border-transparent',
+      info: "",
       warning: 'bg-yellow-100 text-yellow-700 hover:bg-yellow-200 focus:ring-yellow-400 active:bg-yellow-200 active:shadow-inner active:shadow-yellow-400/60 border border-transparent',
       danger: 'bg-red-100 text-red-700 hover:bg-red-200 focus:ring-red-400 active:bg-red-200 active:shadow-inner active:shadow-red-400/60 border border-transparent',

[Survived] StringLiteral
ui/core/tag/theme.ts:11:16
       default: 'bg-gray-100 text-gray-700 hover:bg-gray-200 focus:ring-gray-400 active:bg-gray-200 active:shadow-inner active:shadow-gray-400/60 border border-transparent',
       success: 'bg-green-100 text-green-700 hover:bg-green-200 focus:ring-green-400 active:bg-green-200 active:shadow-inner active:shadow-green-400/60 border border-transparent',
       info: 'bg-blue-100 text-blue-700 hover:bg-blue-200 focus:ring-blue-400 active:bg-blue-200 active:shadow-inner active:shadow-blue-400/60 border border-transparent',
-      warning: 'bg-yellow-100 text-yellow-700 hover:bg-yellow-200 focus:ring-yellow-400 active:bg-yellow-200 active:shadow-inner active:shadow-yellow-400/60 border border-transparent',
+      warning: "",
       danger: 'bg-red-100 text-red-700 hover:bg-red-200 focus:ring-red-400 active:bg-red-200 active:shadow-inner active:shadow-red-400/60 border border-transparent',
       pending: 'bg-orange-100 text-orange-700 hover:bg-orange-200 focus:ring-orange-400 active:bg-orange-200 active:shadow-inner active:shadow-orange-400/60 border border-transparent'

[Survived] StringLiteral
ui/core/tag/theme.ts:12:15
       success: 'bg-green-100 text-green-700 hover:bg-green-200 focus:ring-green-400 active:bg-green-200 active:shadow-inner active:shadow-green-400/60 border border-transparent',
       info: 'bg-blue-100 text-blue-700 hover:bg-blue-200 focus:ring-blue-400 active:bg-blue-200 active:shadow-inner active:shadow-blue-400/60 border border-transparent',
       warning: 'bg-yellow-100 text-yellow-700 hover:bg-yellow-200 focus:ring-yellow-400 active:bg-yellow-200 active:shadow-inner active:shadow-yellow-400/60 border border-transparent',
-      danger: 'bg-red-100 text-red-700 hover:bg-red-200 focus:ring-red-400 active:bg-red-200 active:shadow-inner active:shadow-red-400/60 border border-transparent',
+      danger: "",
       pending: 'bg-orange-100 text-orange-700 hover:bg-orange-200 focus:ring-orange-400 active:bg-orange-200 active:shadow-inner active:shadow-orange-400/60 border border-transparent'
     },

[Killed] StringLiteral
ui/core/tag/theme.ts:16:11
       pending: 'bg-orange-100 text-orange-700 hover:bg-orange-200 focus:ring-orange-400 active:bg-orange-200 active:shadow-inner active:shadow-orange-400/60 border border-transparent'
     },
     sizes: {
-      xs: 'px-2 py-0.5 text-xs',
+      xs: "",
       sm: 'px-2.5 py-1 text-sm',
       md: 'px-3 py-1.5 text-sm',
killedBy: Tag Component Basic Rendering renders xs size correctly
statusReason: expected [ Array(17) ] to include 'px-2'

[Survived] ObjectLiteral
ui/core/tag/theme.ts:24:12
     },
 
   },
-  content: {
-    base: 'flex items-center gap-1.5'
-  },
+  content: {},
   icon: {
     base: 'flex-shrink-0',

[Survived] StringLiteral
ui/core/tag/theme.ts:28:11
     base: 'flex items-center gap-1.5'
   },
   icon: {
-    base: 'flex-shrink-0',
+    base: "",
     sizes: {
       xs: 'w-3 h-3',

[Killed] ObjectLiteral
ui/core/tag/theme.ts:38:11
     }
   },
   // Non-clickable variants (no hover states)
-  static: {
-    variants: {
-      default: 'bg-gray-100 text-gray-700 border border-transparent',
-      success: 'bg-green-100 text-green-700 border border-transparent',
-      info: 'bg-blue-100 text-blue-700 border border-transparent',
-      warning: 'bg-yellow-100 text-yellow-700 border border-transparent',
-      danger: 'bg-red-100 text-red-700 border border-transparent',
-      pending: 'bg-orange-100 text-orange-700 border border-transparent'
-    }
-  }
+  static: {}
 };
 
killedBy: Tag Component Basic Rendering renders with default props
statusReason: Cannot read properties of undefined (reading 'default')

[Killed] StringLiteral
ui/core/tag/theme.ts:42:13
     variants: {
       default: 'bg-gray-100 text-gray-700 border border-transparent',
       success: 'bg-green-100 text-green-700 border border-transparent',
-      info: 'bg-blue-100 text-blue-700 border border-transparent',
+      info: "",
       warning: 'bg-yellow-100 text-yellow-700 border border-transparent',
       danger: 'bg-red-100 text-red-700 border border-transparent',
killedBy: Tag Component Basic Rendering renders info variant correctly
statusReason: expected [ Array(16) ] to include 'bg-blue-100'

[Killed] StringLiteral
ui/core/tag/theme.ts:44:15
       success: 'bg-green-100 text-green-700 border border-transparent',
       info: 'bg-blue-100 text-blue-700 border border-transparent',
       warning: 'bg-yellow-100 text-yellow-700 border border-transparent',
-      danger: 'bg-red-100 text-red-700 border border-transparent',
+      danger: "",
       pending: 'bg-orange-100 text-orange-700 border border-transparent'
     }
killedBy: Tag Component Basic Rendering renders danger variant correctly
statusReason: expected [ Array(16) ] to include 'bg-red-100'

[Killed] StringLiteral
ui/core/tag/theme.ts:45:16
       info: 'bg-blue-100 text-blue-700 border border-transparent',
       warning: 'bg-yellow-100 text-yellow-700 border border-transparent',
       danger: 'bg-red-100 text-red-700 border border-transparent',
-      pending: 'bg-orange-100 text-orange-700 border border-transparent'
+      pending: ""
     }
   }
killedBy: Tag Component Basic Rendering renders pending variant correctly
statusReason: expected [ Array(16) ] to include 'bg-orange-100'

[Killed] ConditionalExpression
ui/core/tag/theme.ts:101:7
 
 // Utility function to merge custom theme with default theme
 export function mergeTagTheme(customTheme?: TagTheme): typeof defaultTagTheme {
-  if (!customTheme) return defaultTagTheme;
+  if (false) return defaultTagTheme;
 
   return {
killedBy: Tag Component Basic Rendering renders with default props
statusReason: Cannot read properties of undefined (reading 'root')

[Killed] BooleanLiteral
ui/core/tag/theme.ts:101:7
 
 // Utility function to merge custom theme with default theme
 export function mergeTagTheme(customTheme?: TagTheme): typeof defaultTagTheme {
-  if (!customTheme) return defaultTagTheme;
+  if (customTheme) return defaultTagTheme;
 
   return {
killedBy: Tag Component Basic Rendering renders with default props
statusReason: Cannot read properties of undefined (reading 'root')

[Killed] LogicalOperator
ui/core/tag/theme.ts:105:13
 
   return {
     root: {
-      base: customTheme.root?.base ?? defaultTagTheme.root.base,
+      base: customTheme.root?.base && defaultTagTheme.root.base,
       variants: {
         ...defaultTagTheme.root.variants,
killedBy: Tag Component Theme Customization applies custom theme
statusReason: expected [ Array(17) ] to include 'custom-base-class'

[Survived] OptionalChaining
ui/core/tag/theme.ts:105:13
 
   return {
     root: {
-      base: customTheme.root?.base ?? defaultTagTheme.root.base,
+      base: customTheme.root.base ?? defaultTagTheme.root.base,
       variants: {
         ...defaultTagTheme.root.variants,

[Survived] OptionalChaining
ui/core/tag/theme.ts:108:12
       base: customTheme.root?.base ?? defaultTagTheme.root.base,
       variants: {
         ...defaultTagTheme.root.variants,
-        ...customTheme.root?.variants
+        ...customTheme.root.variants
       },
       sizes: {

[Survived] OptionalChaining
ui/core/tag/theme.ts:112:12
       },
       sizes: {
         ...defaultTagTheme.root.sizes,
-        ...customTheme.root?.sizes
+        ...customTheme.root.sizes
       },
 

[Survived] ObjectLiteral
ui/core/tag/theme.ts:116:14
       },
 
     },
-    content: {
-      base: customTheme.content?.base ?? defaultTagTheme.content.base
-    },
+    content: {},
     icon: {
       base: customTheme.icon?.base ?? defaultTagTheme.icon.base,

[Killed] OptionalChaining
ui/core/tag/theme.ts:117:13
 
     },
     content: {
-      base: customTheme.content?.base ?? defaultTagTheme.content.base
+      base: customTheme.content.base ?? defaultTagTheme.content.base
     },
     icon: {
killedBy: Tag Component Theme Customization applies custom theme
statusReason: Cannot read properties of undefined (reading 'base')

[Survived] LogicalOperator
ui/core/tag/theme.ts:117:13
 
     },
     content: {
-      base: customTheme.content?.base ?? defaultTagTheme.content.base
+      base: customTheme.content?.base && defaultTagTheme.content.base
     },
     icon: {

[Killed] OptionalChaining
ui/core/tag/theme.ts:120:13
       base: customTheme.content?.base ?? defaultTagTheme.content.base
     },
     icon: {
-      base: customTheme.icon?.base ?? defaultTagTheme.icon.base,
+      base: customTheme.icon.base ?? defaultTagTheme.icon.base,
       sizes: {
         ...defaultTagTheme.icon.sizes,
killedBy: Tag Component Theme Customization applies custom theme
statusReason: Cannot read properties of undefined (reading 'base')

[Survived] LogicalOperator
ui/core/tag/theme.ts:120:13
       base: customTheme.content?.base ?? defaultTagTheme.content.base
     },
     icon: {
-      base: customTheme.icon?.base ?? defaultTagTheme.icon.base,
+      base: customTheme.icon?.base && defaultTagTheme.icon.base,
       sizes: {
         ...defaultTagTheme.icon.sizes,

[Killed] OptionalChaining
ui/core/tag/theme.ts:123:12
       base: customTheme.icon?.base ?? defaultTagTheme.icon.base,
       sizes: {
         ...defaultTagTheme.icon.sizes,
-        ...customTheme.icon?.sizes
+        ...customTheme.icon.sizes
       }
     },
killedBy: Tag Component Theme Customization applies custom theme
statusReason: Cannot read properties of undefined (reading 'sizes')

[Killed] ObjectLiteral
ui/core/tag/theme.ts:126:13
         ...customTheme.icon?.sizes
       }
     },
-    static: {
-      variants: {
-        ...defaultTagTheme.static.variants,
-        ...customTheme.static?.variants
-      }
-    }
+    static: {}
   };
 }
killedBy: Tag Component Theme Customization applies custom theme
statusReason: Cannot read properties of undefined (reading 'default')

[Survived] OptionalChaining
ui/core/tag/theme.ts:129:12
     static: {
       variants: {
         ...defaultTagTheme.static.variants,
-        ...customTheme.static?.variants
+        ...customTheme.static.variants
       }
     }
